Repository: miceno/gallery2-bulkexcelupload
Catalog: po/*.po
Languages: ca, es

source: Bulk upload from XLSX and ZIP file
ca: Pujada massiva a partir de fitxers XLSX i ZIP
es: Subida masiva a partir de ficheros XLSX y ZIP

source: Preparing...
ca: Preparant...
es: Preparando...

source: Initializing data...
ca: Inicialitzant dades...
es: Inicializando datos...

source: Reading XLSX file...
ca: Llegint el fitxer XLSX...
es: Leyendo el fichero XLSX...

source: Reading ZIP listing...
ca: Llegint el fitxer ZIP...
es: Leyendo el fichero ZIP...

source: Uncompressing ZIP file...
ca: Descomprimint el fitxer ZIP...
es: Descomprimiendo el fichero ZIP...

source: Preparing photo metadata...
ca: Preparant les metadades de la fotografia...
es: Preparando los metadatos de la fotografía...

source: %d megabyte
es: % megabyte

source: Bulk Excel Upload
ca: Pujada massiva des d'Excel
es: Subida masiva desde Excel

source: Upload files from Excel and Zip data files
ca: Puja fotografìes mitjant fitxers Excel i ZIP.
es: Sube imágenes a partir de un fichero Excel y un fichero ZIP

source: Import
ca: Importar
es: Importar

source: Wrong mimetype for extension %s of file %s
ca: El tipus MIME per a l'extensió %s del fitxer %s no és correcte
es: El tipo MIME para la extensión %s del fichero %s no es correcto

source: Unable to addItemToAlbum for file %s
ca: No s'ha pogut afegir la fotografia del fitxer '%s'
es: No se ha podido añadir la fotografía del fichero '%s'

source: Unable to setKeywords '%s' for file %s
ca: No s'han pogut canviar les paraules clau '%s' per al fitxer %s
es: No se han podido cambiar las palabras clave '%s' para el fichero %s

source: Succesfully uploaded!!
ca: Tot ha anat bé!!!
es: Todo ha ido bien!!!

source: File %s does not exist
ca: El fitxer %s no existeix
es: El fichero %s no existe

source: There was a problem processing your request, see below for details.
ca: Va haver-hi un problema amb la teva petició, revisa els detalls més a baix.
es: Hubo un problema con tu petición, revisa los detalles más abajo.

source: Upload an XLSX with image descriptions and a ZIP file with the images.
ca: Puja un fitxer XLSX amb la descripció de les fotografies i un fitxer ZIP amb elles.
es: Sube un fichero XLSX con la descripción de las fotografías y un fichero ZIP con ellas.

source: [help]
ca: [ajuda]
es: [ayuda]

source: <b>Note:</b> You can upload up to %s at one time. If you want to upload more than that, you must upload the files separately, use a different upload format, or ask your system administrator to allow larger uploads.
ca: <b>Nota:</b> Pots pujar fins %s a la vegada. Si vols pujar una major quantitat de dades, has de pujar els arxius per blocs, usar un format diferent de pujada, o demanar-li a l'administrador del sistema que habiliti un major ample de banda de pujada.
es: <b>Nota:</b> Puedes subir hasta %s de por vez. Si quieres subir una mayor cantidad de datos, debes subir los archivos por bloques, usar un formato diferente de subida, o pedirle al administrador de sistemas que habilite un mayor ratio de subida.

source: <b>Note:</b> You can upload up to %s at one time. No individual file may be larger than %s. If you want to upload more than that, you must upload the files separately, use a different upload format, or ask your system administrator to allow larger uploads.
ca: <b>Nota:</b> Pots pujar fins %s a la vegada. Els fitxers no han de sobrepassar els %s de forma individual. Si vols pujar una major quantitat de dades, has de pujar els arxius per blocs, fer servir un format diferent de pujada, o demanar-li a l'administrador del sistema que habiliti un major ample de banda de pujada.
es: <b>Nota:</b> Puedes subir hasta %s de por vez. Los ficheros no deben sobrepasar los %s megas de forma individual. Si quieres subir una mayor cantidad de datos, debes subir los archivos por bloques, usar un formato diferente de subida, o pedirle al administrador de sistemas que habilite un mayor ratio de subida.

source: Create an XSLX file containing the Number, Reference, Term, Media, Description, Place, Author and Date for each image. Then create a ZIP with the image files, and enter the path to the XLSX and ZIP files in the box below. For convenience, you can author the data file in Excel and then save it in the XLSX format. Images you want to add must be on the ZIP file in the same order as they are on the XLSX file. Here is a %ssample data file%s and a %ssample excel spreadsheet%s.
ca: Crea un fitxer en format XSLX que contingui les columnes Numero, Referència, Termes, Format, Descripció, Lloc, Autor i Data de cada fotografia. A continuació crea un fitxer ZIP amb les fotografies, assegura't que estan en el mateix ordre que en el fitxer XLSX. Després introdueix les rutes dels fitxers en el formulari de més a baix. Perquè et sigui més fàcil, pots utilitzar MS Excel per a crear el fitxer i després gravar-lo en format XLSX. Aquí tens un %sejemplo de fitxer ZIP%s i de %sfichero XLSX%s.
es: Crea un fichero en formato <b>XSLX</b> que contenga las columnas Numero, Referencia, Términos, Formato, Descripción, Lugar, Autor y Fecha de cada fotografía. A continuación crea un fichero ZIP con las fotografías, asegúrate de que están en el mismo orden que en el fichero XLSX. Luego introduce las rutas de los ficheros en el formulario de más abajo. Para que te sea más fácil, puedes utilizar MS Excel para crear el fichero y luego grabarlo en formato <b>XLSX</b>. Aquí tienes un %sejemplo de fichero ZIP%s y de %sfichero XLSX%s.

source: Excel File
ca: Fitxer Excel
es: Fichero Excel

source: Invalid path for Excel file.
ca: El fitxer Excel no és vàlid.
es: El fichero Excel no es válido.

source: Missing path for Excel file.
ca: Falta el fitxer Excel.
es: Falta el fichero Excel.

source: Read header
ca: Hi ha una línia de capçalera
es: Hay una línea de cabecera

source: Zip File
ca: Fitxer ZIP
es: Fichero ZIP

source: Invalid path for ZIP file.
ca: El fitxer ZIP no és vàlid.
es: El fichero ZIP no es válido.

source: Missing path for ZIP file.
ca: Falta el fitxer ZIP.
es: Falta el fichero ZIP.

source: Add Items
ca: Afegir elements
es: Añadir elementos
